app/controllers/doctors_controller.rb

INSERT INTO "doctors" ("name", "surname", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
	def create
		@doctor = Doctor.new(signup_params)
		if @doctor.save

SELECT  "patients".* FROM "patients" WHERE "patients"."email" = ? LIMIT 1  [["email", "burakozmen@gmail.com"]]
UPDATE "patients" SET "doctor_id" = ?, "updated_at" = ? WHERE "patients"."id" = ?  [["doctor_id", 1], ["updated_at", "2016-04-16 15:01:15.280814"], ["id", 1]]
---
	def add_patient
		patient = Patient.find_by_email(params[:patient][:email])
		if patient
			if patient.doctor
				# zaten bir doktoru var diye flash ver
				redirect_to current_user
			else
				patient.doctor = current_user
				patient.save

SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT 1  [["id", 1]]
---
	def monitor_patient
		@patient = Patient.find(params[:patient_id])