app/controllers/patients_controller.rb

INSERT INTO "patients" ("name", "surname", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
	def create
		@patient = Patient.new(signup_params)
		if @patient.save

SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "patients" SET "surname" = ?, "updated_at" = ? WHERE "patients"."id" = ?  [["surname", "özmenjh"], ["updated_at", "2016-04-16 13:41:14.596654"], ["id", 1]]
---
	def set_init
		@patient = Patient.find(params[:patient_id])
		if @patient.update_attributes(init_params)