app/controllers/patient_session_controller.rb

	def create
    # isim = params[:session][:email]
    # sifre = params[:session][:password]

    email = params[:session][:email].strip.downcase
  	patient = Patient.find_by(email: email)
---
SELECT  "patients".* FROM "patients" WHERE "patients"."email" = ? LIMIT 1  [["email", "burakozmen@gmail.com"]]