app/controllers/sessions_controller.rb

	def create
	    email = params[:session][:email].strip.downcase
	    type =  params[:session][:type]
	    if(type == "patient")
	    	user =Patient.find_by(email: email)
	    elsif(type == "doctor")
	    	user = Doctor.find_by(email: email)
---
SELECT  "patients".* FROM "patients" WHERE "patients"."email" = ? LIMIT 1  [["email", "burakozmen93@gmail.com"]]
SELECT  "doctors".* FROM "doctors" WHERE "doctors"."email" = ? LIMIT 1  [["email", "burakozmen@outlook.com"]]